Австралия/src/ExchangePlans/Website/Website.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="977752df-d5ba-4bf6-960a-ab398b03be20">
  <name>Website</name>
  <attributes>
    <name>ApplicationParameters</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>DataExchangeByCommonCatalog</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataExchangeByWebService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DataExchangeToWebsite</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultCustomer</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultItemForShipping</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportBalances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportBatches</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportChangesOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportDirectory</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportImages</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportPrices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportProducts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportSerialNumbers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportVariants</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportCustomers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportFile</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IntegrationComponent</name>
    <type>
      <types>CatalogRef.IntegrationComponents</types>
    </type>
  </attributes>
  <attributes>
    <name>OverwriteOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PartSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RepeatCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ScheduledJobID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StoredCatalogTable</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAutomaticExchange</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Username</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UsernameWebsite</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebsiteAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceTypes</name>
    <attributes>
      <name>PriceType</name>
      <type>
        <types>CatalogRef.PriceTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Австралия/src/Catalogs/AdditionalAttributesAndInfoSets/AdditionalAttributesAndInfoSets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AdditionalAttributesAndInfoSets</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Catalog_Products</name>
      <description>Catalog &quot;Products&quot;</description>
    </items>
    <items>
      <name>Catalog_ProductsCharacteristics</name>
      <description>Product variants</description>
    </items>
    <items>
      <name>Document_AccountingTransaction</name>
      <description>Accounting transaction</description>
    </items>
    <items>
      <name>Document_ActualSalesVolume</name>
      <description>Actual sales volume</description>
    </items>
    <items>
      <name>Document_BankReconciliation</name>
      <description>Bank reconciliation</description>
    </items>
    <items>
      <name>Catalog_Banks</name>
      <description>Banks</description>
    </items>
    <items>
      <name>Catalog_CashFlowItems</name>
      <description>Cash flow items</description>
    </items>
    <items>
      <name>Document_CashVoucher</name>
      <description>Cash payment</description>
    </items>
    <items>
      <name>Document_CashReceipt</name>
      <description>Cash receipt</description>
    </items>
    <items>
      <name>Catalog_Counterparties</name>
      <description>Catalog counterparties</description>
    </items>
    <items>
      <name>Catalog_Employees</name>
      <description>Catalog employees</description>
    </items>
    <items>
      <name>Catalog_SerialNumbers</name>
      <description>Catalog serial numbers</description>
    </items>
    <items>
      <name>Catalog_Companies</name>
      <description>Companies</description>
    </items>
    <items>
      <name>Catalog_ContactPersons</name>
      <description>Contact persons</description>
    </items>
    <items>
      <name>Catalog_CounterpartyContracts</name>
      <description>Counterparty's contracts</description>
    </items>
    <items>
      <name>Document_CreditNote</name>
      <description>Credit note</description>
    </items>
    <items>
      <name>Document_CustomsDeclaration</name>
      <description>Customs declaration</description>
    </items>
    <items>
      <name>Document_DebitNote</name>
      <description>Debit note</description>
    </items>
    <items>
      <name>Document_DirectDebit</name>
      <description>Direct debit</description>
    </items>
    <items>
      <name>Document_EmployeeTask</name>
      <description>Employee task</description>
    </items>
    <items>
      <name>Document_Event</name>
      <description>Event</description>
    </items>
    <items>
      <name>Document_PaymentExpense</name>
      <description>Expense</description>
    </items>
    <items>
      <name>Catalog_ExternalUsers</name>
      <description>External users</description>
    </items>
    <items>
      <name>Catalog_Files</name>
      <description>File</description>
    </items>
    <items>
      <name>Catalog_FileFolders</name>
      <description>Folder</description>
    </items>
    <items>
      <name>Document_ForeignCurrencyExchange</name>
      <description>Foreign currency exchange</description>
    </items>
    <items>
      <name>Document_GoodsIssue</name>
      <description>Goods issue</description>
    </items>
    <items>
      <name>Document_GoodsReceipt</name>
      <description>Goods receipt</description>
    </items>
    <items>
      <name>Document_IncomingEmail</name>
      <description>Incoming email message</description>
    </items>
    <items>
      <name>Catalog_Individuals</name>
      <description>Individuals</description>
    </items>
    <items>
      <name>Document_InventoryTransfer</name>
      <description>Inventory transfer</description>
    </items>
    <items>
      <name>Document_KitOrder</name>
      <description>Kit order</description>
    </items>
    <items>
      <name>Catalog_Leads</name>
      <description>Leads</description>
    </items>
    <items>
      <name>Catalog_LegalDocuments</name>
      <description>Legal documents</description>
    </items>
    <items>
      <name>Document_LoanContract</name>
      <description>Loan contract</description>
    </items>
    <items>
      <name>Document_LoanInterestCommissionAccruals</name>
      <description>Loan interest commission accruals</description>
    </items>
    <items>
      <name>Document_Meeting</name>
      <description>Meeting</description>
    </items>
    <items>
      <name>Document_OnlinePayment</name>
      <description>Online payment</description>
    </items>
    <items>
      <name>Document_OnlineReceipt</name>
      <description>Online receipt</description>
    </items>
    <items>
      <name>Document_OutgoingEmail</name>
      <description>Outgoing email message</description>
    </items>
    <items>
      <name>Document_PaymentReceipt</name>
      <description>Payment receipt</description>
    </items>
    <items>
      <name>Document_ExpenditureRequest</name>
      <description>Payment request</description>
    </items>
    <items>
      <name>Document_PhoneCall</name>
      <description>Phone call</description>
    </items>
    <items>
      <name>Catalog_ProductsBatches</name>
      <description>Product batches</description>
    </items>
    <items>
      <name>Document_Production</name>
      <description>Production</description>
    </items>
    <items>
      <name>Document_Manufacturing</name>
      <description>Production (ver. 2)</description>
    </items>
    <items>
      <name>Document_ProductionOrder</name>
      <description>Production order</description>
    </items>
    <items>
      <name>Document_ProductionTask</name>
      <description>Production task</description>
    </items>
    <items>
      <name>Document_PurchaseOrder</name>
      <description>Purchase order</description>
    </items>
    <items>
      <name>Document_Quote</name>
      <description>Quote</description>
    </items>
    <items>
      <name>Document_ReconciliationStatement</name>
      <description>Reconciliation statement</description>
    </items>
    <items>
      <name>Document_RequestForQuotation</name>
      <description>Request for quotation</description>
    </items>
    <items>
      <name>Document_RequisitionOrder</name>
      <description>Requisition order</description>
    </items>
    <items>
      <name>Document_RMARequest</name>
      <description>RMA request</description>
    </items>
    <items>
      <name>Catalog_SalesGoalSettings</name>
      <description>Sales goal settings</description>
    </items>
    <items>
      <name>Document_SalesInvoice</name>
      <description>Sales invoice</description>
    </items>
    <items>
      <name>Document_SalesOrder</name>
      <description>Sales order</description>
    </items>
    <items>
      <name>Document_PlannedInteraction</name>
      <description>Scheduled interaction</description>
    </items>
    <items>
      <name>Catalog_BusinessUnits</name>
      <description>Structural units</description>
    </items>
    <items>
      <name>Document_SubcontractorInvoiceIssued</name>
      <description>Subcontractor invoice issued</description>
    </items>
    <items>
      <name>Document_SubcontractorInvoiceReceived</name>
      <description>Subcontractor invoice received</description>
    </items>
    <items>
      <name>Document_SubcontractorOrderIssued</name>
      <description>Subcontractor order issued</description>
    </items>
    <items>
      <name>Document_SubcontractorOrderReceived</name>
      <description>Subcontractor order received</description>
    </items>
    <items>
      <name>Document_SupplierInvoice</name>
      <description>Supplier invoice</description>
    </items>
    <items>
      <name>Document_SupplierQuote</name>
      <description>Supplier invoice for payment</description>
    </items>
    <items>
      <name>Catalog_SuppliersProducts</name>
      <description>Supplier products</description>
    </items>
    <items>
      <name>Document_SMSMessage</name>
      <description>Text message</description>
    </items>
    <items>
      <name>Document_TransferOrder</name>
      <description>Transfer order</description>
    </items>
    <items>
      <name>Catalog_Users</name>
      <description>Users</description>
    </items>
    <items>
      <name>Document_VATInvoiceForICT</name>
      <description>VAT invoice for ICT</description>
    </items>
    <items>
      <name>Document_WorkOrder</name>
      <description>Work order</description>
    </items>
  </predefined>
  <attributes>
    <name>AttributesNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InfoCount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Used</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalInfo</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>DeletionMark</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/ExchangePlans/Website/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Procedure EnableDisableScheduledJob(JobSchedule) Export
	
	
	Job = CurrentJob();
	If UseAutomaticExchange Then
		
		JobParameters = JobProperties(JobSchedule);
		
		If Job = Undefined Then
			
			JobParameters.Insert("Metadata", Metadata.ScheduledJobs.ExchangeWithWebsite);
			JobParameters.Insert("Key", String(New UUID));
			JobParameters.Insert("Use", True);
			
			JobID = NewJob(JobParameters);
			ScheduledJobID = JobID;
		Else
			SetJobParameters(Job, JobParameters);
		EndIf;
		
	Else
		
		If Job <> Undefined Then
			DeleteJob(Job);
		EndIf;
		ScheduledJobID = Undefined;
		
	EndIf;

EndProcedure

Function CurrentJob() Export
	
	Filter = New Structure;
	
	If Common.DataSeparationEnabled() Then
		Filter.Insert("Key", ScheduledJobID);
	Иначе
		If ValueIsFilled(ScheduledJobID) Then
			Filter.Insert("ID", New UUID(ScheduledJobID));
		EndIf;
		Filter.Insert("Description", ScheduledJobDescription());
		
	EndIf;

	Filter.Insert("Metadata", Metadata.ScheduledJobs.ExchangeWithWebsite);
	
	Found = ScheduledJobsServer.FindJobs(Filter);
	Job = ?(Found.Count() = 0, Undefined, Found[0]);
	
	Return Job;
	
EndFunction

Function JobProperties(JobSchedule = Undefined) Export
	
	Parameters = New Array;
	Parameters.Add(Code);
	
	JobParameters = New Structure;
	If Not JobSchedule = Undefined Then
		JobParameters.Insert("Schedule", JobSchedule);
	EndIf;
	JobParameters.Insert("Parameters", Parameters);
	JobParameters.Insert("MethodName", Metadata.ScheduledJobs.ExchangeWithWebsite.MethodName);
	JobParameters.Insert("Description", ScheduledJobDescription());

	Return JobParameters;
	
EndFunction

#EndRegion

#Region EventHandlers

Procedure BeforeDelete(Cancel)
	
	// There is no DataExchange.Import property value verification as the code below implements the 
	// logic, which must be executed, including when this property is set to True (on the side of the 
	// code that attempts to record to this exchange plan).
	
	// The exchange plan uses a safe storage, that is why the correspondent record must be deleted from 
	// the storage when deleting an exchange node (according to basic functionality subsystem 
	// documentation).
	
	SetPrivilegedMode(True);
	Common.DeleteDataFromSecureStorage(Ref);
	SetPrivilegedMode(False);
	
EndProcedure

Procedure BeforeWrite(Cancel)
		
	If IsBlankString(Code) Then
		SetNewCode();
	EndIf;
	
	PriceTypes.GroupBy("PriceType");
	Warehouses.GroupBy("Warehouse");
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If ImportOrders Then
		
		Item = ChartsOfCharacteristicTypes.AdditionalAttributesAndInfo.FindByDescription(NStr("en = 'ID on website'; ru = 'Идентификатор на сайте';pl = 'Identyfikator na stronie internetowej';es_ES = 'ID en el sitio web';es_CO = 'ID en el sitio web';tr = 'Web sitesindeki kimlik numarası';it = 'ID su sito web';de = 'ID auf Webseite'"));
		If Not ValueIsFilled(Item) Then
			
			SalesOrders = NStr("en = 'Sales orders'; ru = 'Заказы покупателей';pl = 'Zamówienia sprzedaży';es_ES = 'Órdenes de ventas';es_CO = 'Órdenes de ventas';tr = 'Satış siparişleri';it = 'Ordini Cliente';de = 'Kundenaufträge'");
			PropertySet = Catalogs.AdditionalAttributesAndInfoSets.FindByDescription(SalesOrders);
			
			Property = ChartsOfCharacteristicTypes.AdditionalAttributesAndInfo.CreateItem();
			Property.Title			= NStr("en = 'ID on website'; ru = 'Идентификатор на сайте';pl = 'Identyfikator na stronie internetowej';es_ES = 'ID en el sitio web';es_CO = 'ID en el sitio web';tr = 'Web sitesindeki kimlik numarası';it = 'ID su sito web';de = 'ID auf Webseite'");
			Property.Description	= StringFunctionsClientServer.SubstituteParametersToString(Property.Title + " (%1)",
				SalesOrders);
			Property.Visible		= True;
			Property.Available		= True;
			Property.ValueType		= New TypeDescription("Number");
			Property.PropertySet	= PropertySet;
			
			Name = StringFunctionsClientServer.ReplaceCharsWithOther("-  ", Title(Property.Title) + "_" + New UUID, "");
			Property.Name			= Name;
			Property.Write();
			
			PropertySetObject = PropertySet.GetObject();
			
			NewRow = PropertySetObject.AdditionalAttributes.Add();
			NewRow.Property = Property.Ref;
			PropertySetObject.AttributesNumber = PropertySetObject.AttributesNumber + 1;
			PropertySetObject.Write();
			
		EndIf;
		
	EndIf;
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If ThisNode Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "IntegrationComponent");
	EndIf;
	
	If Not ImportOrders
		Or ImportCustomers Then
		DriveServer.DeleteAttributeBeingChecked(CheckedAttributes, "DefaultCustomer");
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

Function ScheduledJobDescription()
	
	Name = NStr("en = 'Data exchange with website: %1.'; ru = 'Обмен данными с веб-сайтом: %1.';pl = 'Wymiana danych ze stroną internetową: %1.';es_ES = 'Intercambio de datos con el sitio web: %1.';es_CO = 'Intercambio de datos con el sitio web: %1.';tr = 'Web sitesi ile veri değişimi: %1.';it = 'Scambio dati con il sito web: %1.';de = 'Datenaustausch mit Webseite: %1.'");
	JobName = StringFunctionsClientServer.SubstituteParametersToString(Name, Code);
	
	Return JobName;
	
EndFunction

Procedure DeleteJob(Job)
	
	ScheduledJobsServer.DeleteJob(Job);
	
EndProcedure

Function NewJob(JobParameters)
	
	ScheduledJob = ScheduledJobsServer.AddJob(JobParameters);
	
	If TypeOf(ScheduledJob) = Type("ValueTableRow") Then
		ID = ScheduledJob.Key;
	Else
		ID = String(ScheduledJob.UUID);
	EndIf;
	
	Return ID;
	
EndFunction

Procedure SetJobParameters(Job, JobProperties)
	
	If Job = Undefined Then
		Return;
	EndIf;
	
	ScheduledJobsServer.ChangeJob(Job, JobProperties);
	SetPrivilegedMode(True);
	
EndProcedure

#EndRegion

#EndIf
